Программа курса
Добро пожаловать на курс!
Материалы курса - ZIP-файлы для скачивания
Установка Anaconda, Python, Jupyter Notebook
Прочтите эту статью - Замечание о настройке среды разработки
Настройка среды разработки
Часто задаваемые вопросы
Полезные советы об интерфейсе Stepik (опционально)
Пару слов об экспресс-курсе
Экспресс-курс по Python - Часть 1
Экспресс-курс по Python - Часть 2
Экспресс-курс по Python - Часть 3
Проверочные упражнения по Python
Решения для проверочных упражнений по Python
Этапы работ по машинному обучению
Обзор раздела про NumPy
Массивы NumPy
Индексация и выбор данных из массивов NumPy
Операции в NumPy
Проверочные упражнения по NumPy
Решения для проверочных упражнений по NumPy
Обзор раздела про Pandas
Series - Часть 1
Series - Часть 2
Датафреймы - Часть 1 - Создание датафреймов
Датафреймы - Часть 2 - Основные атрибуты
Датафреймы - Часть 3 - Работа с колонками
Датафреймы - Часть 4 - Работа со строками
Выборка данных по условию (Conditional Filtering)
Полезные методы - Apply для одной колонки
Полезные методы - Apply для нескольких колонок
Полезные методы - Статистическая информация и сортировка данных
Отсутствующие данные (missing data) - Обзор
Отсутствующие данные (missing data) - Операции в Pandas
Агрегация данных GROUP BY - Часть 1
Агрегация данных GROUP BY - Часть 2 - Мульти-индекс
Объединение датафреймов - Конкатенация
Объединение датафреймов - Inner Merge
Объединение датафреймов - Left и Right Merge
Объединение датафреймов - Outer Merge
Методы Pandas для текста
Методы Pandas для даты и времени
Input/Output в Pandas - CSV-файлы
Input/Output в Pandas - HTML-таблицы
Input/Output в Pandas - Excel-файлы
Input/Output в Pandas - SQL базы данных
Сводные таблицы в Pandas (pivot tables)
Проверочные упражнения по Pandas
Решения для проверочных упражнений по Pandas
Обзор раздела про Matplotlib
Основы Matplotlib
Объект Figure - принципы работы
Объект Figure - код в Python
Объект Figure - код в Python
Subplots - несколько графиков рядом друг с другом
Стилизация Matplotlib: легенды
Стилизация Matplotlib: цвета и стили
Дополнительные материалы по Matplotlib
Проверочные упражнения по Matplotlib
Решения для проверочных упражнений по Matplotlib
Обзор раздела про Seaborn
Scatterplots - Графики рассеяния (диаграммы рассеяния)
Distribution Plots - Часть 1 - Типы графиков
Distribution Plots - Часть 2 - Код в Python
Categorical Plots - Статистики по категориям - Типы графиков
Categorical Plots - Статистики по категориям - Код в Python
Categorical Plots - Распределения по категориям - Типы графиков
Categorical Plots - Распределения по категориям - Код в Python
Графики сравнения - Типы графиков
Графики сравнения - Код в Python
Seaborn Grid
Матричные графики
Проверочные упражнения по Seaborn
Решения для проверочных упражнений по Seaborn
Обзор Проекта по Визуализации Данных
Разбор решений проекта - Часть 1
Разбор решений проекта - Часть 2
Разбор решений проекта - Часть 3
Обзор раздела
Зачем нужно машинное обучение
Типы алгоритмов машинного обучения
Процесс для обучения с учителем (supervised learning)
(ОПЦИОНАЛЬНО) Дополнительная книга для чтения - ISLR
Обзор раздела про линейную регрессию
Линейная регрессия - История алгоритма
Наименьшие квадраты
Функция стоимости (Cost Function)
Градиентный спуск (Gradient Descent)
Простая линейная регрессия
Обзор Scikit-Learn
Scikit-Learn - Train Test Split
Scikit-Learn - оценка работы модели
Графики остатков - Residual Plots
Внедрение модели и интерпретация коэффициентов
Полиномиальная регрессия - теория
Полиномиальная регрессия - создание признаков
Полиномиальная регрессия - обучение и оценка модели
Дилемма смещения-дисперсии (Bias-Variance Trade-Off)
Полиномиальная регрессия - выбираем степень полинома
Полиномиальная регрессия - внедрение модели
Регуляризация - обзор
Масштабирование признаков (feature scaling)
Кросс-валидация - обзор
Регуляризация - подготовка данных
L2 Регуляризация - Ридж-регрессия - теория
L2 Регуляризация - Ридж-регрессия - код в Python
L1 Регуляризация - Лассо-регрессия - теория и код в Python
L1 и L2 Регуляризация - Эластичная сеть Elastic Net
Обзор данных для проверочного проекта по линейной регрессии
Обзор Feature Engineering
Работа с выбросами (outliers)
Работа с отсутствующими данными (missing data) - Часть 1
Работа с отсутствующими данными (missing data) - Часть 2
Работа с отсутствующими данными (missing data) - Часть 3
Работа с категориальными переменными
Обзор раздела про кросс-валидацию
Разбиение Train | Test Split
Разбиение Train | Validation | Test Split
Кросс-валидация - cross_val_score
Кросс-валидация - cross_validate
Поиск по сетке - Grid Search
Обзор проверочного проекта по линейной регрессии
Решения для проверочного проекта по линейной регрессии
Обзор раздела про логистическую регрессию
Теория логистической регрессии - Часть 1 - Логистическая функция
Теория логистической регрессии - Часть 2 - От линейной к логист.
Теория логистической регрессии - Часть 3 - Математика перехода
Теория логистической регрессии - Часть 4 - Поиск графика
Логистическая регрессия в Scikit-Learn - Часть 1 - EDA
Логистическая регрессия в Scikit-Learn - Часть 2 - Модель
Метрики классификации - Confusion Matrix и Accuracy
Метрики классификации - Precision, Recall и F1-Score
Метрики классификации - ROC-кривые
Логистическая регрессия в Scikit-Learn - Часть 3 - Оценка модели
Мульти-классовая классификация - Логистическая регрессия - EDA
Мульти-классовая классификация - Логистическая регрессия -Модель
Проверочный проект по логистической регрессии
Решения для проверочного проекта по логистической регрессии
Обзор раздела про метод К-ближайших соседей
Теория метода К-ближайших соседей
KNN: пишем код в Python - Часть 1
KNN: пишем код в Python - Часть 2
Проверочные упражнения по KNN
Решения для проверочных упражнений по KNN
Обзор раздела про метод опорных векторов
История метода опорных векторов
Теория метода опорных векторов - Гиперплоскости и зазоры
Теория метода опорных векторов - ядра (kernels)
Теория метода опорных векторов - "kernel trick" и математика
SVM в Scikit-Learn для задач классификации - Часть 1
SVM в Scikit-Learn для задач классификации - Часть 2
SVM в Scikit-Learn для задач регрессии
Проверочные упражнения по методу опорных векторов
Решения для проверочных упражнений по методу опорных векторов
Обзор раздела про деревья решений
Деревья решений - История
Деревья решений - Терминология
Деревья решений - метрика "Gini Impurity"
Построение деревьев решений с помощью Gini Impurity - Часть 1
Построение деревьев решений с помощью Gini Impurity - Часть 2
Код в Python для деревьев решений - Часть 1 - Данные
Код в Python для деревьев решений - Часть 2 - Модель
Обзор раздела про случайные леса
История и мотивация создания случайных лесов
Гиперпараметры случайного леса - Обзор
Гиперпараметры случайного леса - Количество деревьев и Признаков
Гиперпараметры случайного леса - Bootstrapping и oob_score
Классификация данных с помощью RandomForestClassifier - Часть 1
Классификация данных с помощью RandomForestClassifier - Часть 2
Регрессия с помощью RandomForestRegressor - Часть 1 - Данные
Регрессия с помощью RandomForestRegressor - Часть 2 - Модели 1
Регрессия с помощью RandomForestRegressor - Часть 3 - Модели 2
Регрессия с помощью RandomForestRegressor - Часть 4 - Модели 3
Обзор раздела про бустинг
История возникновения бустинга
AdaBoost - Теория - Как работает адаптивный бустинг
AdaBoost - Код в Python - Данные
AdaBoost - Код в Python - Модель
Градиентный бустинг - Теория
Градиентный бустинг - Пишем код в Python
Обзор проверочного проекта
Разбор решений - Часть 1 - Исследование данных (EDA)
Разбор решений - Часть 2 - Анализ оттока (Churn Analysis)
Разбор решений - Часть 3 - Модели на основе деревьев решений
Обзор раздела про NLP и Наивный Байесовский алгоритм
Наивный Байесовский алгоритм - Часть 1 - Теорема Байеса
Наивный Байесовский алгоритм - Часть 2 - сам алгоритм
Извлечение признаков из текста - Теория
Извлечение признаков из текста, "Мешок слов" - пишем код вручную
Извлечение признаков из текста с помощью Scikit-Learn
Классификация текста - Часть 1
Классификация текста - Часть 2
Проверочные упражнения по классификации текста
Решения для проверочных упражнений по классификации текста
Обзор обучения без учителя - Unsupervised Learning
Обзор раздела про кластеризацию К-средних
Принципы кластеризации данных (без привязки к алгоритму)
Теория кластеризации К-средних
Кластеризация К-средних - Пишем код - Часть 1
Кластеризация К-средних - Пишем код - Часть 2
Выбираем количество кластеров К - Теория
Выбираем количество кластеров К - Пишем код в Python
Квантование цветов - Теория
Квантование цветов - Пишем код в Python
Проверочные упражнения по кластеризации К-средних
Решения для проверочных упражнений - Часть 1
Решения для проверочных упражнений - Часть 2
Решения для проверочных упражнений - Часть 3
Обзор раздела про иерархическую кластеризацию
Теория и интуиция иерархической кластеризации
Иерархическая кластеризация - Пишем код, часть 1 - Данные
Иерархическая кластеризация - Пишем код, часть 2 - Scikit-Learn
Обзор раздела про кластеризацию DBSCAN
Теория алгоритма DBSCAN
Сравниваем DBSCAN и K-Means Clustering
Ключевые гиперпараметры DBSCAN - Теория
Ключевые гиперпараметры DBSCAN - код в Python
Проверочные упражнения по DBSCAN
Решения для проверочных упражнений по DBSCAN
Обзор раздела про метод главных компонент
Теория метода главных компонент - Часть 1 - История и интуиция
Теория метода главных компонент - Часть 2 - Математика
Реализация метода главных компонент вручную
Метод главных компонент в Scikit-Learn
Проверочные упражнения по методу главных компонент
Решения для проверочных упражнений по методу главных компонент
Пройдите короткий тест
Резюме курса
Финальные шаги